Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.WorksetJoinWarn
Two elements were not automatically joined because one or both is not editable.

Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.Unknown
Unknown

Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.UnexpectedJoinFailure
Join failure caused by editability or design option related problem.

Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.OtherNonEditJoinFailure
Two elements were not automatically joined because other elements at join are not editable.

Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.DesignOptionCannotReference
Design Option ' [Name] ' cannot reference Design Option ' [Name] '.

Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.DesignOptionAndWorksetViolation
Can't make the expected join because of editability and design option restrictions.

Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures
Failures about AutoJoin.